import streamlit as st
import pandas as pd
import numpy as np

st.title("🥢南宁美食探索")
st.text("探索广西南宁最受欢迎的美食地点！选择你感兴趣的餐厅类型，查看评分和位置。")

st.header("📍南宁美食地图")
#地图
map_data = {"latitude": [22.853966, 22.810761, 22.845768, 22.790446,23.202054,22.838009],
    "longitude": [108.222561, 108.401252, 108.301052, 108.312107,108.182322,108.268402]
    }
mp_df = pd.DataFrame(map_data)
st.map(mp_df)


st.header("⭐餐厅评分")
# 餐厅数据
restaurants_data = {
    "餐厅": ["北方土菜馆", "肯德基(盛天地店)", "兰州拉面(秀隆店)", "三品王(江南万达店)", "塔斯汀(武鸣大帽路店)","正宗南宁老友粉"],
    "类型": ["自助餐", "西餐", "中餐", "中餐", "快餐","中餐"],
    "评分": [4.2, 3.2, 4.6, 2.7, 3.8,5.0],
    "人均消费(元)": [50, 20, 15, 20, 10, 10],
    "latitude": [22.853966, 22.810761, 22.845768, 22.790446,23.202054,22.838009],
    "longitude": [108.222561, 108.401252, 108.301052, 108.312107,108.182322,108.268402]
}

# 定义数据框所用的新索引
index = pd.Series([1, 2, 3, 4, 5, 6], name='序号')

# 根据上面创建的data，创建数据框
df = pd.DataFrame(restaurants_data, index=index)

# 条形图
st.bar_chart(df.set_index('餐厅')['评分'])

st.header("💰不同类型餐厅价格")
different_data = {
    "类型": ["自助餐", "西餐", "中餐", "中餐", "快餐","中餐"],
    "价格": [70, 100, 50, 20, 16, 120]
    }
# 根据上面创建的different_data，创建数据框
df = pd.DataFrame(different_data)
# 通过x指定类型所在这一列为折线图的x轴
st.line_chart(df, x='类型')


st.header("💰不同餐厅12月价格走势")
price_data = {
    '月份':['01月', '02月', '03月','04月', '05月', '06月','07月', '08月', '09月','10月', '11月', '12月'],
    '北方土菜馆(人均)': [85, 82, 80, 78, 83, 86, 88, 90, 85, 87, 92, 95],
    '肯德基(盛天地店)(人均)': [45, 43, 42, 40, 42, 44, 45, 46, 44, 43, 45, 48],
    '兰州拉面(秀隆店)(单碗)': [18, 18, 19, 19, 20, 20, 21, 21, 20, 20, 21, 22], 
    '三品王(江南万达店)(单碗)': [16, 16, 17, 17, 18, 18, 19, 19, 18, 18, 19, 20],
    '塔斯汀(武鸣大帽路店)(单人餐)': [25, 24, 23, 22, 24, 25, 26, 26, 25, 24, 26, 28],
    '正宗南宁老友粉(单碗)': [15, 15, 16, 16, 17, 17, 18, 18, 17, 17, 18, 19] 
}

# 根据上面创建的price_data，创建数据框
df = pd.DataFrame(price_data)

# 通过x指定月份所在这一列为折线图的x轴
st.line_chart(df, x='月份')


st.header("🕛用餐高峰时段")
# 餐厅数据
time_data = {
    '时间':[ '08:00', '09:00', '10:00', '11:00', '12:00', '13:00', '14:00', '15:00','16:00', '17:00', '18:00', '19:00', '20:00', '21:00', '22:00', '23:00', '24:00'],
    '北方土菜馆': [10, 15, 20, 50, 180, 150, 60, 30, 40, 80, 200, 180, 120, 70, 40, 20, 10],
    '肯德基(盛天地店)': [60, 70, 80, 100, 160, 140, 90, 80, 90, 110, 180, 160, 130, 110, 90, 70, 50],
    '兰州拉面(秀隆店)': [50, 60, 50, 80, 150, 120, 60, 40, 50, 70, 120, 90, 60, 40, 30, 20, 10],
    '三品王(江南万达店)': [100, 120, 80, 90, 140, 100, 50, 30, 40, 60, 80, 60, 40, 30, 20, 10, 5],
    '塔斯汀(武鸣大帽路店)': [20, 25, 30, 80, 160, 120, 70, 90, 80, 100, 200, 170, 110, 80, 60, 40, 20],
    '正宗南宁老友粉': [150, 180, 100, 70, 120, 80, 40, 20, 30, 50, 70, 50, 30, 20, 10, 5, 0]
}

# 根据上面创建的time_data，创建数据框
df = pd.DataFrame(time_data)

# 通过x指定时间所在这一列为面积图的x轴
st.line_chart(df, x='时间')
